espruino/Espruino/targets/stm32_ll/jshardware.c
/*
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2013 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * Hardware interface Layer
 * NOTE: The definitions of these functions are inside:
 *                                         targets/{target}/jshardware.c
 * ----------------------------------------------------------------------------
 */
 
#ifdef USB
 #ifdef LEGACY_USB
  #include "legacy_usb.h"
 #else
  #include "usbd_cdc_hid.h"
 #endif
#endif
#include "jshardware.h"
#include "jstimer.h"
#include "jsutils.h"
#include "jsparse.h"
#include "jsinteractive.h"
#include "jswrap_io.h"

#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_exti.h"
#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */


#define IRQ_PRIOR_SPI 1 // we want to be very sure of not losing SPI (this is handled quickly too)
#define IRQ_PRIOR_SYSTICK 2
#define IRQ_PRIOR_USART 6 // a little higher so we don't get lockups of something tries to print
#define IRQ_PRIOR_MED 7
#define IRQ_PRIOR_LOW 15


// ----------------------------------------------------------------------------
//                                                                        PINS

// Whether a pin is being used for soft PWM or not
BITFIELD_DECL(jshPinSoftPWM, JSH_PIN_COUNT);

volatile unsigned int ticksSinceStart = 0;
volatile JsSysTime SysTickMajor = SYSTICK_RANGE;

int JSH_DELAY_MULTIPLIER = 1;

static ALWAYS_INLINE unsigned int getSystemTimerFreq() {
  return SystemCoreClock;
}

static ALWAYS_INLINE uint8_t pinToEVEXTI(Pin ipin) {
  JsvPinInfoPin pin = pinInfo[ipin].pin;
  return (uint8_t)(EV_EXTI0+(pin-JSH_PIN0));
  /*if (pin==JSH_PIN0 ) return EV_EXTI0;
  if (pin==JSH_PIN1 ) return EV_EXTI1;
  if (pin==JSH_PIN2 ) return EV_EXTI2;
  if (pin==JSH_PIN3 ) return EV_EXTI3;
  if (pin==JSH_PIN4 ) return EV_EXTI4;
  if (pin==JSH_PIN5 ) return EV_EXTI5;
  if (pin==JSH_PIN6 ) return EV_EXTI6;
  if (pin==JSH_PIN7 ) return EV_EXTI7;
  if (pin==JSH_PIN8 ) return EV_EXTI8;
  if (pin==JSH_PIN9 ) return EV_EXTI9;
  if (pin==JSH_PIN10) return EV_EXTI10;
  if (pin==JSH_PIN11) return EV_EXTI11;
  if (pin==JSH_PIN12) return EV_EXTI12;
  if (pin==JSH_PIN13) return EV_EXTI13;
  if (pin==JSH_PIN14) return EV_EXTI14;
  if (pin==JSH_PIN15) return EV_EXTI15;
  jsExceptionHere(JSET_INTERNALERROR, "pinToEVEXTI");
  return EV_NONE;*/
}

static ALWAYS_INLINE uint16_t stmPin(Pin ipin) {
  JsvPinInfoPin pin = pinInfo[ipin].pin;
#if 0
  return (uint16_t)(1 << (pin-JSH_PIN0));
#else
  if (pin==JSH_PIN0 ) return LL_GPIO_PIN_0;
  if (pin==JSH_PIN1 ) return LL_GPIO_PIN_1;
  if (pin==JSH_PIN2 ) return LL_GPIO_PIN_2;
  if (pin==JSH_PIN3 ) return LL_GPIO_PIN_3;
  if (pin==JSH_PIN4 ) return LL_GPIO_PIN_4;
  if (pin==JSH_PIN5 ) return LL_GPIO_PIN_5;
  if (pin==JSH_PIN6 ) return LL_GPIO_PIN_6;
  if (pin==JSH_PIN7 ) return LL_GPIO_PIN_7;
  if (pin==JSH_PIN8 ) return LL_GPIO_PIN_8;
  if (pin==JSH_PIN9 ) return LL_GPIO_PIN_9;
  if (pin==JSH_PIN10) return LL_GPIO_PIN_10;
  if (pin==JSH_PIN11) return LL_GPIO_PIN_11;
  if (pin==JSH_PIN12) return LL_GPIO_PIN_12;
  if (pin==JSH_PIN13) return LL_GPIO_PIN_13;
  if (pin==JSH_PIN14) return LL_GPIO_PIN_14;
  if (pin==JSH_PIN15) return LL_GPIO_PIN_15;
  jsExceptionHere(JSET_INTERNALERROR, "stmPin");
  return LL_GPIO_PIN_0;
#endif
}
static ALWAYS_INLINE uint32_t stmExtI(Pin ipin) {
  JsvPinInfoPin pin = pinInfo[ipin].pin;
#if 0
  return (uint32_t)(1 << (pin-JSH_PIN0));
#else
  if (pin==JSH_PIN0 ) return LL_EXTI_LINE_0;
  if (pin==JSH_PIN1 ) return LL_EXTI_LINE_1;
  if (pin==JSH_PIN2 ) return LL_EXTI_LINE_2;
  if (pin==JSH_PIN3 ) return LL_EXTI_LINE_3;
  if (pin==JSH_PIN4 ) return LL_EXTI_LINE_4;
  if (pin==JSH_PIN5 ) return LL_EXTI_LINE_5;
  if (pin==JSH_PIN6 ) return LL_EXTI_LINE_6;
  if (pin==JSH_PIN7 ) return LL_EXTI_LINE_7;
  if (pin==JSH_PIN8 ) return LL_EXTI_LINE_8;
  if (pin==JSH_PIN9 ) return LL_EXTI_LINE_9;
  if (pin==JSH_PIN10) return LL_EXTI_LINE_10;
  if (pin==JSH_PIN11) return LL_EXTI_LINE_11;
  if (pin==JSH_PIN12) return LL_EXTI_LINE_12;
  if (pin==JSH_PIN13) return LL_EXTI_LINE_13;
  if (pin==JSH_PIN14) return LL_EXTI_LINE_14;
  if (pin==JSH_PIN15) return LL_EXTI_LINE_15;
  jsExceptionHere(JSET_INTERNALERROR, "stmExtI");
  return LL_EXTI_LINE_0;
#endif
}

static ALWAYS_INLINE GPIO_TypeDef *stmPort(Pin pin) {

  JsvPinInfoPort port = pinInfo[pin].port;
#if 0
  return (GPIO_TypeDef *)((char*)GPIOA + (port-JSH_PORTA)*0x0400);
#else
  if (port == JSH_PORTA) return GPIOA;
  if (port == JSH_PORTB) return GPIOB;
  if (port == JSH_PORTC) return GPIOC;
  if (port == JSH_PORTD) return GPIOD;
  if (port == JSH_PORTE) return GPIOE;
  if (port == JSH_PORTF) return GPIOF;
  if (port == JSH_PORTG) return GPIOG;
  if (port == JSH_PORTH) return GPIOH;
  jsExceptionHere(JSET_INTERNALERROR, "stmPort");
  return GPIOA;
#endif
}

static ALWAYS_INLINE uint32_t stmPinSource(JsvPinInfoPin ipin) {

  JsvPinInfoPin pin = pinInfo[ipin].pin;
#if 0
  return (uint8_t)(pin-JSH_PIN0);
#else
  if (pin==JSH_PIN0 ) return LL_SYSCFG_EXTI_LINE0;
  if (pin==JSH_PIN1 ) return LL_SYSCFG_EXTI_LINE1;
  if (pin==JSH_PIN2 ) return LL_SYSCFG_EXTI_LINE2;
  if (pin==JSH_PIN3 ) return LL_SYSCFG_EXTI_LINE3;
  if (pin==JSH_PIN4 ) return LL_SYSCFG_EXTI_LINE4;
  if (pin==JSH_PIN5 ) return LL_SYSCFG_EXTI_LINE5;
  if (pin==JSH_PIN6 ) return LL_SYSCFG_EXTI_LINE6;
  if (pin==JSH_PIN7 ) return LL_SYSCFG_EXTI_LINE7;
  if (pin==JSH_PIN8 ) return LL_SYSCFG_EXTI_LINE8;
  if (pin==JSH_PIN9 ) return LL_SYSCFG_EXTI_LINE9;
  if (pin==JSH_PIN10) return LL_SYSCFG_EXTI_LINE10;
  if (pin==JSH_PIN11) return LL_SYSCFG_EXTI_LINE11;
  if (pin==JSH_PIN12) return LL_SYSCFG_EXTI_LINE12;
  if (pin==JSH_PIN13) return LL_SYSCFG_EXTI_LINE13;
  if (pin==JSH_PIN14) return LL_SYSCFG_EXTI_LINE14;
  if (pin==JSH_PIN15) return LL_SYSCFG_EXTI_LINE15;
  jsExceptionHere(JSET_INTERNALERROR, "stmPinSource");
  return LL_SYSCFG_EXTI_LINE0;
#endif
}

static ALWAYS_INLINE uint8_t stmPortSource(Pin pin) {
  JsvPinInfoPort port = pinInfo[pin].port;
#if 0
  return (uint8_t)(port-JSH_PORTA);
#else
  if (port == JSH_PORTA) return LL_SYSCFG_EXTI_PORTA;
  if (port == JSH_PORTB) return LL_SYSCFG_EXTI_PORTB;
  if (port == JSH_PORTC) return LL_SYSCFG_EXTI_PORTC;
  if (port == JSH_PORTD) return LL_SYSCFG_EXTI_PORTD;
  if (port == JSH_PORTE) return LL_SYSCFG_EXTI_PORTE;
  if (port == JSH_PORTF) return LL_SYSCFG_EXTI_PORTF;
  if (port == JSH_PORTG) return LL_SYSCFG_EXTI_PORTG;
  if (port == JSH_PORTH) return LL_SYSCFG_EXTI_PORTH;
  jsExceptionHere(JSET_INTERNALERROR, "stmPortSource");
  return LL_SYSCFG_EXTI_PORTA;
#endif
}

static ALWAYS_INLINE uint8_t functionToAF(JshPinFunction func) {
  switch (func & JSH_MASK_AF) {
  case JSH_AF0   : return LL_GPIO_AF_0;
  case JSH_AF1   : return LL_GPIO_AF_1;
  case JSH_AF2   : return LL_GPIO_AF_2;
  case JSH_AF3   : return LL_GPIO_AF_3;
  case JSH_AF4   : return LL_GPIO_AF_4;
  case JSH_AF5   : return LL_GPIO_AF_5;
  case JSH_AF6   : return LL_GPIO_AF_6;
  case JSH_AF7   : return LL_GPIO_AF_7;
  case JSH_AF8   : return LL_GPIO_AF_8;
  case JSH_AF9   : return LL_GPIO_AF_9;
  case JSH_AF10  : return LL_GPIO_AF_10;
  case JSH_AF11  : return LL_GPIO_AF_11;
  case JSH_AF12  : return LL_GPIO_AF_12;
  case JSH_AF13  : return LL_GPIO_AF_13;
  case JSH_AF14  : return LL_GPIO_AF_14;
  case JSH_AF15  : return LL_GPIO_AF_15;
  default: jsExceptionHere(JSET_INTERNALERROR, "functionToAF");return 0;
  }
}

void jshSetAFPin(GPIO_TypeDef* port, uint8_t pin, uint8_t af) {
  if(pin > LL_GPIO_PIN_0 && pin <=LL_GPIO_PIN_7){
    LL_GPIO_SetAFPin_0_7(port, pin, af);
  } else {
    LL_GPIO_SetAFPin_8_15(port, pin, af);
  }
  LL_GPIO_SetPinMode(port, pin, LL_GPIO_MODE_ALTERNATE);

